mikeakohn/naken_asm/include/8051/stc16fxx.inc
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; STC16Fxx include
;; part of the naken_asm assembler
;;
;; Generated by: Cjacker Huang (cjacker@gmail.com)
;;         Date: 2022-05-21
;;        Parts: STC16Fxx
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

DPXL equ 0x84
USBCLK equ 0x85
DPS equ 0x86
CKCON equ 0x8e
DMAIR equ 0x8f
USBCON equ 0x91
WTST equ 0x92
AUXR2 equ 0x94
INTCLKO equ 0x95
USBADR equ 0x96
USBDAT equ 0x97
P_SW1 equ 0x9a
P_SW2 equ 0x9b
BGTRIM equ 0x9c
VRTRIM equ 0x9d
LIRTRIM equ 0x9e
IRTRIM equ 0x9f
CANICR equ 0xa1
CANAR equ 0xa2
CANDR equ 0xa3
IRCBAND equ 0xa9
WKTCL equ 0xaa
WKTCH equ 0xab
VOCTRL equ 0xac
VOSEL equ 0xad
LINICR equ 0xb1
LINAR equ 0xb2
LINDR equ 0xb3
CMPCR1 equ 0xb4
CMPCR2 equ 0xb5
IP2H equ 0xb6
IPH equ 0xb7
SPSTAT equ 0xb9
SPCTL equ 0xba
SPDAT equ 0xbb
S4CON equ 0xbc
S4BUF equ 0xbd
SPH equ 0xbe
BUSSPD equ 0xbf
DID equ 0xc1
IAP_DATA equ 0xc2
IAP_ADDRH equ 0xc3
IAP_ADDRL equ 0xc4
IAP_CMD equ 0xc5
IAP_TRIG equ 0xc6
IAP_CONTR equ 0xc7
T4H equ 0xc9
T4L equ 0xca
T3H equ 0xcb
T3L equ 0xcc
T2H equ 0xcd
T2L equ 0xce
PSW1 equ 0xd1
P7M1 equ 0xd2
P7M0 equ 0xd3
RSTIF equ 0xd8
AUXINTIF equ 0xda
T4T3M equ 0xdb
ADC_CONTR equ 0xdc
ADC_RES equ 0xdd
ADC_RESL equ 0xde
ADCCFG equ 0xdf
SADDR equ 0xe1
SADEN equ 0xe2
S2CON equ 0xe3
S2BUF equ 0xe4
S3CON equ 0xe5
S3BUF equ 0xe6
IE2 equ 0xe7
MXAX equ 0xea
TA equ 0xeb
P5M1 equ 0xec
P5M0 equ 0xed
P6M1 equ 0xee
P6M0 equ 0xef
P0M1 equ 0xf1
P0M0 equ 0xf2
P1M1 equ 0xf3
P1M0 equ 0xf4
P2M1 equ 0xf5
P2M0 equ 0xf6
IAP_TPS equ 0xf7
P3M1 equ 0xf9
P3M0 equ 0xfa
P4M1 equ 0xfb
P4M0 equ 0xfc
WDT_CONTR equ 0xfd
IP2 equ 0xfe
RSTCFG equ 0xff

; bit aliases

IT0 equ 0x88+0
IE0 equ 0x88+1
IT1 equ 0x88+2
IE1 equ 0x88+3
TR0 equ 0x88+4
TF0 equ 0x88+5
TR1 equ 0x88+6
TF1 equ 0x88+7
RI equ 0x98+0
TI equ 0x98+1
RB8 equ 0x98+2
TB8 equ 0x98+3
REN equ 0x98+4
SM2 equ 0x98+5
SM1 equ 0x98+6
SM0 equ 0x98+7
EX0 equ 0xa8+0
ET0 equ 0xa8+1
EX1 equ 0xa8+2
ET1 equ 0xa8+3
ES equ 0xa8+4
EADC equ 0xa8+5
ELVD equ 0xa8+6
EA equ 0xa8+7
PX0 equ 0xb8+0
PT0 equ 0xb8+1
PX1 equ 0xb8+2
PT1 equ 0xb8+3
PS0 equ 0xb8+4
PS equ 0xb8+4
PADC equ 0xb8+5
PLVD equ 0xb8+6
PPWM1 equ 0xb8+7
P equ 0xd0+0
F1 equ 0xd0+1
OV equ 0xd0+2
RS0 equ 0xd0+3
RS1 equ 0xd0+4
F0 equ 0xd0+5
AC equ 0xd0+6
CY equ 0xd0+7

; xdata

CLKSEL equ 0x7efe00
CLKDIV equ 0x7efe01
IRC24MCR equ 0x7efe02
XOSCCR equ 0x7efe03
IRC32KCR equ 0x7efe04
PLLCR equ 0x7efe05
USBCON1 equ 0x7efe06
MCLKOCR equ 0x7efe07
IRC48MCR equ 0x7efe08
IRC48ATRIM equ 0x7efe09
IRC48BTRIM equ 0x7efe0a
IRCDB equ 0x7efe0b
P0PU equ 0x7efe10
P1PU equ 0x7efe11
P2PU equ 0x7efe12
P3PU equ 0x7efe13
P4PU equ 0x7efe14
P5PU equ 0x7efe15
P6PU equ 0x7efe16
P7PU equ 0x7efe17
P0NCS equ 0x7efe18
P1NCS equ 0x7efe19
P2NCS equ 0x7efe1a
P3NCS equ 0x7efe1b
P4NCS equ 0x7efe1c
P5NCS equ 0x7efe1d
P6NCS equ 0x7efe1e
P7NCS equ 0x7efe1f
P0SR equ 0x7efe20
P1SR equ 0x7efe21
P2SR equ 0x7efe22
P3SR equ 0x7efe23
P4SR equ 0x7efe24
P5SR equ 0x7efe25
P6SR equ 0x7efe26
P7SR equ 0x7efe27
P0DR equ 0x7efe28
P1DR equ 0x7efe29
P2DR equ 0x7efe2a
P3DR equ 0x7efe2b
P4DR equ 0x7efe2c
P5DR equ 0x7efe2d
P6DR equ 0x7efe2e
P7DR equ 0x7efe2f
P0IE equ 0x7efe30
P1IE equ 0x7efe31
I2CCFG equ 0x7efe80
I2CMSCR equ 0x7efe81
I2CMSST equ 0x7efe82
I2CSLCR equ 0x7efe83
I2CSLST equ 0x7efe84
I2CSLADR equ 0x7efe85
I2CTXD equ 0x7efe86
I2CRXD equ 0x7efe87
I2CMSAUX equ 0x7efe88
TIMER2PS equ 0x7efea2
TIMER3PS equ 0x7efea3
TIMER4PS equ 0x7efea4
ADCTIM equ 0x7efeab
T3T4PS equ 0x7efeac
PWM1_ETRPS equ 0x7efeb0
PWM1_ENO equ 0x7efeb1
PWM1_PS equ 0x7efeb2
PWM1_IOAUX equ 0x7efeb3
PWM2_ETRPS equ 0x7efeb4
PWM2_ENO equ 0x7efeb5
PWM2_PS equ 0x7efeb6
PWM2_IOAUX equ 0x7efeb7
PWMA_ETRPS equ 0x7efeb0
PWMA_ENO equ 0x7efeb1
PWMA_PS equ 0x7efeb2
PWMA_IOAUX equ 0x7efeb3
PWMB_ETRPS equ 0x7efeb4
PWMB_ENO equ 0x7efeb5
PWMB_PS equ 0x7efeb6
PWMB_IOAUX equ 0x7efeb7
PWM1_CR1 equ 0x7efec0
PWM1_CR2 equ 0x7efec1
PWM1_SMCR equ 0x7efec2
PWM1_ETR equ 0x7efec3
PWM1_IER equ 0x7efec4
PWM1_SR1 equ 0x7efec5
PWM1_SR2 equ 0x7efec6
PWM1_EGR equ 0x7efec7
PWM1_CCMR1 equ 0x7efec8
PWM1_CCMR2 equ 0x7efec9
PWM1_CCMR3 equ 0x7efeca
PWM1_CCMR4 equ 0x7efecb
PWM1_CCER1 equ 0x7efecc
PWM1_CCER2 equ 0x7efecd
PWM1_CNTRH equ 0x7efece
PWM1_CNTRL equ 0x7efecf
PWM1_PSCRH equ 0x7efed0
PWM1_PSCRL equ 0x7efed1
PWM1_ARRH equ 0x7efed2
PWM1_ARRL equ 0x7efed3
PWM1_RCR equ 0x7efed4
PWM1_CCR1H equ 0x7efed5
PWM1_CCR1L equ 0x7efed6
PWM1_CCR2H equ 0x7efed7
PWM1_CCR2L equ 0x7efed8
PWM1_CCR3H equ 0x7efed9
PWM1_CCR3L equ 0x7efeda
PWM1_CCR4H equ 0x7efedb
PWM1_CCR4L equ 0x7efedc
PWM1_BKR equ 0x7efedd
PWM1_DTR equ 0x7efede
PWM1_OISR equ 0x7efedf
PWM2_CR1 equ 0x7efee0
PWM2_CR2 equ 0x7efee1
PWM2_SMCR equ 0x7efee2
PWM2_ETR equ 0x7efee3
PWM2_IER equ 0x7efee4
PWM2_SR1 equ 0x7efee5
PWM2_SR2 equ 0x7efee6
PWM2_EGR equ 0x7efee7
PWM2_CCMR1 equ 0x7efee8
PWM2_CCMR2 equ 0x7efee9
PWM2_CCMR3 equ 0x7efeea
PWM2_CCMR4 equ 0x7efeeb
PWM2_CCER1 equ 0x7efeec
PWM2_CCER2 equ 0x7efeed
PWM2_CNTRH equ 0x7efeee
PWM2_CNTRL equ 0x7efeef
PWM2_PSCRH equ 0x7efef0
PWM2_PSCRL equ 0x7efef1
PWM2_ARRH equ 0x7efef2
PWM2_ARRL equ 0x7efef3
PWM2_RCR equ 0x7efef4
PWM2_CCR1H equ 0x7efef5
PWM2_CCR1L equ 0x7efef6
PWM2_CCR2H equ 0x7efef7
PWM2_CCR2L equ 0x7efef8
PWM2_CCR3H equ 0x7efef9
PWM2_CCR3L equ 0x7efefa
PWM2_CCR4H equ 0x7efefb
PWM2_CCR4L equ 0x7efefc
PWM2_BKR equ 0x7efefd
PWM2_DTR equ 0x7efefe
PWM2_OISR equ 0x7efeff
PWMA_CR1 equ 0x7efec0
PWMA_CR2 equ 0x7efec1
PWMA_SMCR equ 0x7efec2
PWMA_ETR equ 0x7efec3
PWMA_IER equ 0x7efec4
PWMA_SR1 equ 0x7efec5
PWMA_SR2 equ 0x7efec6
PWMA_EGR equ 0x7efec7
PWMA_CCMR1 equ 0x7efec8
PWMA_CCMR2 equ 0x7efec9
PWMA_CCMR3 equ 0x7efeca
PWMA_CCMR4 equ 0x7efecb
PWMA_CCER1 equ 0x7efecc
PWMA_CCER2 equ 0x7efecd
PWMA_CNTRH equ 0x7efece
PWMA_CNTRL equ 0x7efecf
PWMA_PSCRH equ 0x7efed0
PWMA_PSCRL equ 0x7efed1
PWMA_ARRH equ 0x7efed2
PWMA_ARRL equ 0x7efed3
PWMA_RCR equ 0x7efed4
PWMA_CCR1H equ 0x7efed5
PWMA_CCR1L equ 0x7efed6
PWMA_CCR2H equ 0x7efed7
PWMA_CCR2L equ 0x7efed8
PWMA_CCR3H equ 0x7efed9
PWMA_CCR3L equ 0x7efeda
PWMA_CCR4H equ 0x7efedb
PWMA_CCR4L equ 0x7efedc
PWMA_BKR equ 0x7efedd
PWMA_DTR equ 0x7efede
PWMA_OISR equ 0x7efedf
PWMB_CR1 equ 0x7efee0
PWMB_CR2 equ 0x7efee1
PWMB_SMCR equ 0x7efee2
PWMB_ETR equ 0x7efee3
PWMB_IER equ 0x7efee4
PWMB_SR1 equ 0x7efee5
PWMB_SR2 equ 0x7efee6
PWMB_EGR equ 0x7efee7
PWMB_CCMR1 equ 0x7efee8
PWMB_CCMR2 equ 0x7efee9
PWMB_CCMR3 equ 0x7efeea
PWMB_CCMR4 equ 0x7efeeb
PWMB_CCER1 equ 0x7efeec
PWMB_CCER2 equ 0x7efeed
PWMB_CNTRH equ 0x7efeee
PWMB_CNTRL equ 0x7efeef
PWMB_PSCRH equ 0x7efef0
PWMB_PSCRL equ 0x7efef1
PWMB_ARRH equ 0x7efef2
PWMB_ARRL equ 0x7efef3
PWMB_RCR equ 0x7efef4
PWMB_CCR1H equ 0x7efef5
PWMB_CCR1L equ 0x7efef6
PWMB_CCR2H equ 0x7efef7
PWMB_CCR2L equ 0x7efef8
PWMB_CCR3H equ 0x7efef9
PWMB_CCR3L equ 0x7efefa
PWMB_CCR4H equ 0x7efefb
PWMB_CCR4L equ 0x7efefc
PWMB_BKR equ 0x7efefd
PWMB_DTR equ 0x7efefe
PWMB_OISR equ 0x7efeff
